Repository: openstack/heat
Catalog: heat/locale/*/LC_MESSAGES/heat-log-error.po
Languages: de, fr

source: Ec2Token authorization failed, no auth_uri specified in config file
fr: Échec de l’autorisation Ec2Token, pas auth_uri spécifié dans le fichier de configuration

source: Request does not contain %s parameter!
fr: La requete ne doit pas contenir le paramètre %s!

source: Request does not contain required MetricData
fr: La requête ne doit pas contenir comme pré-requis MetricData

source: Exception in string format operation
fr: Exception dans le formatage de la chaîne

source: Admin client authentication failed
fr: Echec d'authentification Admin client

source: Domain admin client authentication failed
fr: Echec d'authentification Domain admin client

source: Unknown version in auth_token_info
fr: Version inconnu dans auth_tokern_info

source: Keystone v3 API connection failed, no password trust or auth_token!
fr: Échec de la connexion Keystone v3 API, pas de mot de passe de confiance ou auth_token!

source: Failed to add user %(user)s to role %(role)s, check role exists!
fr: Échec d'ajout de l'utilisateur %(user)s pour le rôle %(role)s, vérifier si le role existe!

source: %(opname) %(ci)s failed for %(a)s on %(sid)s
fr: %(opname) %(ci)s échec pour %(a)s sur %(sid)s

source: Failed to import module %s
fr: Echec lors de l'import du module %s

source: SIGTERM received
fr: SIGTERM reçu

source: SIGHUP received
fr: SIGHUP reçu

source: Removing dead child %s
fr: Retrait de l'enfant arrêté %s

source: Exception handling resource: %s
fr: Exception lors du traitement de la ressource : %s

source: Returning %(code)s to user: %(explanation)s
fr: Renvoie %(code)s à l'utilisateur : %(explanation)s

source: Failed to read %s
fr: Echec de lecture %s

source: Failed to parse %(file_path)s
fr: Echec d'analyse %(file_path)s

source: Failed to read %(file_path)s
fr: Echec de lecture %(file_path)s

source: Failed to load %(mapping_name)s from %(module)s
fr: Echec de chargement %(mapping_name)s depuis %(module)s

source: Invalid type for %(mapping_name)s from %(module)s
fr: Type invalide pour %(mapping_name)s depuis %(module)s

source: DB error %s
fr: Erreur base de donné %s

source: Unable to retrieve stack %s for periodic task
fr: Impossible de récupérer la stack %s pour la tache périodique

source: Unexpected action %s passed to update!
fr: Action inattendu %s à mettre à jour!

source: Unexpected action %s passed to delete!
fr: Action inattendu %s à supprimer!

source: Resource %(name)s delete failed: %(ex)s
fr: Ressource %(name)s échec de suppression: %(ex)s

source: Port not specified.
fr: Port non spécifié

source: Metadata failed validation for %s
fr: Echec de validation de metadata pour %s

source: in fixed duration looping call
de: in Schleifenaufruf mit festgelegter Dauer
fr: dans l'appel en boucle de durée fixe

source: in dynamic looping call
de: in dynamischen Schleifenaufruf
fr: dans l'appel en boucle dynamique

source: Failed to understand rule %s
de: Regel %s konnte nicht verstanden werden
fr: Règle %s incompréhensible

source: No handler for matches of kind %s
de: Kein Handler für Übereinstimmungen des Typs %s
fr: Aucun gestionnaire pour les correspondances de type %s

source: Unhandled exception
de: Nicht behandelte Ausnahme
fr: Exception non gérée

source: Original exception being dropped: %s
de: Ursprüngliche Ausnahme wird gelöscht: %s

source: Unexpected exception occurred %d time(s)... retrying.
de: Unerwartete Ausnahme %d mal(e) aufgetreten... Neuversuch.

source: Could not release the acquired lock `%s`
de: Angeforderte Sperre `%s` konnte nicht freigegeben werden

source: Failed to understand rule %r
de: Regel %r konnte nicht verstanden werden

source: Exception during rpc cleanup.
de: Ausnahme bei RPC Cleanup.
